# EXPLORATORY DATA ANALYSIS

*In this workbook we will be working with Data Scientists salarys Dataset (Obtained from Kagle)*

In [2]:
%pip install numpy pandas

Requirement already satisfied: numpy in c:\users\germa\appdata\local\programs\python\python311\lib\site-packages (2.1.1)
Requirement already satisfied: pandas in c:\users\germa\appdata\local\programs\python\python311\lib\site-packages (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\germa\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\germa\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\germa\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\germa\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv(r"C:\Users\germa\Documents\GitHub\Data-Science---Salary-\data\ds_salaries.csv")

In [16]:
df.head(3) #Just to check if data is correctly uploaded

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S

In [17]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [18]:
df.shape # To see dimensions

(3755, 11)

In [19]:
df.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [20]:
df.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

## DATA PRE PROCESSING

In [21]:
df.duplicated().sum() # 1171 files are duplicated

np.int64(1171)

In [22]:
duplicated_files = df[df.duplicated(keep=False)]
duplicated_files

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
5,2023,SE,FT,Applied Scientist,222200,USD,222200,US,0,US,L
6,2023,SE,FT,Applied Scientist,136000,USD,136000,US,0,US,L
9,2023,SE,FT,Data Scientist,147100,USD,147100,US,0,US,M
10,2023,SE,FT,Data Scientist,90700,USD,90700,US,0,US,M
11,2023,SE,FT,Data Analyst,130000,USD,130000,US,100,US,M
...,...,...,...,...,...,...,...,...,...,...,...
3441,2022,SE,FT,Data Engineer,115000,USD,115000,US,100,US,M
3502,2021,MI,FT,Data Engineer,200000,USD,200000,US,100,US,L
3586,2021,MI,FT,Data Engineer,200000,USD,200000,US,100,US,L
3665,2021,MI,FT,Data Scientist,76760,EUR,90734,DE,50,DE,L
3709,2021,MI,FT,Data Scientist,76760,EUR,90734,DE,50,DE,L

In [23]:
duplicate_count = df.value_counts()
duplicated_files = duplicate_count[duplicate_count > 1]
duplicated_files

work_year  experience_level  employment_type  job_title           salary   salary_currency  salary_in_usd  employee_residence  remote_ratio  company_location  company_size
2022       SE                FT               Data Scientist      141525   USD              141525         US                  100           US                M               21
                                                                  191475   USD              191475         US                  100           US                M               21
2023       SE                FT               Data Engineer       252000   USD              252000         US                  0             US                M               13
                                                                  129000   USD              129000         US                  0             US                M               13
2022       SE                FT               Data Engineer       130000   USD              130000         US                  0             US                M               12
                                                                                                                                                                               ..
                                              Data Scientist      92000    USD              92000          US                  100           US                L                2
2023       EX                FT               Data Engineer       235000   USD              235000         US                  0             US                M                2
           EN                FT               Research Engineer   155000   USD              155000         US                  0             US                M                2
           SE                FT               Research Scientist  253750   USD              253750         ES                  0             ES                M                2
2020       EN                FT               Data Engineer       1000000  INR              13493          IN                  100           IN                L                2
Name: count, Length: 544, dtype: int64

ERRASING DUPLICATED DATA

In [24]:
df.drop_duplicates(inplace = True)

In [25]:
df.shape

(2584, 11)

## EDA

Which country are most companies from?

In [43]:
df.groupby("company_location").agg({"company_location" : "count"}).rename(columns={"company_location": "total"}).reset_index().sort_values(by=["total"], ascending=False)

   company_location  total
70               US   3040
28               GB    172
12               CA     87
25               ES     77
38               IN     58
..              ...    ...
50               MT      1
48               MD      1
56               PH      1
66               SK      1
71               VN      1

[72 rows x 2 columns]

Which job position earns the most money by country?

In [16]:
df.groupby(by=['company_location', 'job_title']).agg({"salary_in_usd" : "mean"}).reset_index().sort_values(by=['job_title', 'salary_in_usd'], ascending=False)

    company_location                      job_title  salary_in_usd
354               US           Staff Data Scientist       105000.0
63                CA             Staff Data Analyst        15000.0
272               SG         Software Data Engineer        75020.0
24                AU         Software Data Engineer        50000.0
114               ES             Research Scientist       211475.0
..               ...                            ...            ...
220               MK                   AI Developer         6304.0
73                CR  3D Computer Vision Researcher        50000.0
7                 AS  3D Computer Vision Researcher        20000.0
2                 AL  3D Computer Vision Researcher        10000.0
175               IN  3D Computer Vision Researcher         5409.0

[356 rows x 3 columns]

Which country are the highest paying companies from?

In [18]:
df.groupby("company_location").agg({"salary_in_usd":"mean"}).round(2).reset_index().sort_values(by=["salary_in_usd"],ascending=False)

   company_location  salary_in_usd
37               IL      271446.50
59               PR      167500.00
70               US      151822.01
62               RU      140333.33
12               CA      131917.69
..              ...            ...
71               VN       12000.00
1                AL       10000.00
47               MA       10000.00
9                BO        7500.00
49               MK        6304.00

[72 rows x 2 columns]

How much is earned on average by experience level?

In [19]:
df.groupby("experience_level").agg({"salary_in_usd":"mean"}).round(2).reset_index().sort_values(by=["salary_in_usd"],ascending=False)

  experience_level  salary_in_usd
1               EX      194930.93
3               SE      153051.07
2               MI      104525.94
0               EN       78546.28

How many companies are there for each size category?

In [42]:
df.groupby("company_size",).agg({"company_size" : "count"}).rename(columns={"company_size": "total"}).reset_index().sort_values(by=["total"], ascending=False)

  company_size  total
1            M   3153
0            L    454
2            S    148

What are the top six countries with the most LARGE companies?

In [41]:
df[df["company_size"] == "L"].groupby(["company_size","company_location"]).agg({"company_size" : "count"}).rename(columns={"company_size": "total"}).reset_index().sort_values(by=["total"], ascending=False).head(6)

   company_size company_location  total
43            L               US    263
25            L               IN     38
18            L               GB     20
7             L               CA     18
13            L               DE     17
17            L               FR     10

What is the average salary according to the type of contract and the level of experience?

In [39]:
df.groupby(["employment_type","experience_level"]).agg(average_salary =("salary_in_usd", "mean")).round(2).reset_index().sort_values(by=["employment_type" , "experience_level"],ascending=False)

   employment_type experience_level  average_salary
12              PT               MI        42561.00
11              PT               EN        38885.00
10              FT               SE       153214.45
9               FT               MI       105321.49
8               FT               EX       192974.57
7               FT               EN        80496.53
6               FL               SE        53333.33
5               FL               MI        41615.60
4               FL               EN        75000.00
3               CT               SE        97500.00
2               CT               MI        78600.00
1               CT               EX       416000.00
0               CT               EN        65234.50

At what experience level are there more employees?"

In [30]:
df["id"] = df.index

In [35]:
df.groupby("experience_level").agg({"id" : "count"}).rename(columns={"id" : "total"}).reset_index().sort_values(by="total",ascending=False)

  experience_level  total
3               SE   2516
2               MI    805
0               EN    320
1               EX    114